app/Http/Controllers/Backend/Inventory/RequisitionController.php

    public function index(){
    	$data['requisition'] = RequisitionHead::orderBy('id','desc')->get();
---
select * from `requisition_heads` order by `id` desc

    public function create(){
        $items = Item::all();
        $unit = Unit::all();
        $currency = Currency::all();
        $user = User::where('usertype','employee')->get();
---
select * from `items`
select * from `units`
select * from `currencies`
select * from `users` where `usertype` = 'employee'