app/Http/Controllers/Backend/Student/StdAttendanceController.php

select `std_attendances`.`att_date`, `std_attendances`.`att_status`, `std_attendances`.`login_time`, `std_attendances`.`logout_time`, `users`.*, `users`.`id_no`, `student_classes`.`name` as `class`, `student_years`.`name` as `year`, `student_shifts`.`name` as `shift`, `student_groups`.`name` as `group` from `std_attendances` inner join `users` on `std_attendances`.`id_no` = `users`.`id` inner join `assign_students` on `std_attendances`.`id_no` = `assign_students`.`student_id` inner join `student_classes` on `assign_students`.`class_id` = `student_classes`.`id` inner join `student_years` on `assign_students`.`year_id` = `student_years`.`id` inner join `student_shifts` on `assign_students`.`shift_id` = `student_shifts`.`id` inner join `student_groups` on `assign_students`.`group_id` = `student_groups`.`id`
select * from `student_classes`
select * from `student_years`
select * from `student_shifts`
select * from `student_groups`
---
    public function StdAttendanceView(){
        // Create relation between users and assign_students  and std_attendances table and student_classes, student_years, student_shifts, student_groups tables wher user Table and std_attendances relation is user id = id_no and user table and assign_students relation is user id = student_id and assign_students table and std_attendances relation is student_id = id_no and student_classes table and assign_students relation is student_class_id = id and student_years table and assign_students relation is student_year_id = id and student_shifts table and assign_students relation is student_shift_id = id and student_groups table and assign_students relation is student_group_id = id
        //create relation user table and std_attendances using joining


        $data['students'] = DB::table('std_attendances')
        ->join('users', 'std_attendances.id_no','=','users.id')
        ->join('assign_students','std_attendances.id_no','=','assign_students.student_id')
        ->join('student_classes','assign_students.class_id','=','student_classes.id')
        ->join('student_years','assign_students.year_id', '=', 'student_years.id')
        ->join('student_shifts','assign_students.shift_id', '=', 'student_shifts.id')
        ->join('student_groups','assign_students.group_id', '=', 'student_groups.id')
        ->select('std_attendances.att_date','std_attendances.att_status', 'std_attendances.login_time', 'std_attendances.logout_time', 'users.*','users.id_no','student_classes.name as class','student_years.name as year','student_shifts.name as shift','student_groups.name as group')
        // ->where('assign_students.year_id', $year_id)
        ->get();
        // if($data['allData']->count() != 0){
        //     $data['allData'] = json_encode($data['allData']);

        // }else{
        //     return json_encode('No Data Found');
        // }
        // $data['allData'] = AssignStudent::all();


        $data['classes'] = StudentClass::all();
        $data['years'] = StudentYear::all();
        $data['shifts'] = StudentShift::all();
        $data['groups'] = StudentGroup::all();

select * from `student_classes`
select * from `student_years`
select * from `student_shifts`
select * from `student_groups`
select `users`.`fname`, `users`.`id_no`, `student_classes`.`name` as `class`, `student_years`.`name` as `year`, `student_shifts`.`name` as `shift`, `student_groups`.`name` as `group`, `assign_students`.`roll` from `users` inner join `assign_students` on `users`.`id` = `assign_students`.`student_id` inner join `student_classes` on `assign_students`.`class_id` = `student_classes`.`id` inner join `student_years` on `assign_students`.`year_id` = `student_years`.`id` inner join `student_shifts` on `assign_students`.`shift_id` = `student_shifts`.`id` inner join `student_groups` on `assign_students`.`group_id` = `student_groups`.`id` where `assign_students`.`year_id` = '1' and `assign_students`.`class_id` = '1' and `assign_students`.`shift_id` = '2' and `assign_students`.`group_id` = '1'
---
    public function StudentYeraClassShiftGroupWise(Request $request){
        $year_id = $request->year_id;
        $class_id = $request->class_id;
        $shift_id = $request->shift_id;
        $group_id = $request->group_id;
        $data['classes'] = StudentClass::all();
        $data['years'] = StudentYear::all();
        $data['shifts'] = StudentShift::all();
        $data['groups'] = StudentGroup::all();

        if($request->has('add')){
        $data['students'] = DB::table('users')
        ->join('assign_students', 'users.id', '=', 'assign_students.student_id')
        ->join('student_classes', 'assign_students.class_id', '=', 'student_classes.id')
        ->join('student_years', 'assign_students.year_id', '=', 'student_years.id')
        ->join('student_shifts', 'assign_students.shift_id', '=', 'student_shifts.id')
        ->join('student_groups', 'assign_students.group_id', '=', 'student_groups.id')
        ->select('users.fname', 'users.id_no', 'student_classes.name as class', 'student_years.name as year', 'student_shifts.name as shift', 'student_groups.name as group', 'assign_students.roll')
        ->where('assign_students.year_id', $year_id)
        ->where('assign_students.class_id', $class_id)
        ->where('assign_students.shift_id', $shift_id)
        ->where('assign_students.group_id', $group_id)
        ->get();

select * from `student_classes`
select * from `student_years`
select * from `student_shifts`
select * from `student_groups`
---
            ->where('assign_students.shift_id', $shift_id)
            ->where('assign_students.group_id', $group_id)
            ->get();
            $data['classes'] = StudentClass::all();
            $data['years'] = StudentYear::all();
            $data['shifts'] = StudentShift::all();
            $data['groups'] = StudentGroup::all();

insert into `std_attendances` (`id_no`, `att_date`, `att_status`, `login_time`, `logout_time`, `updated_at`, `created_at`) values ('20230010', '17-06-23', 'P', '16:40', '05:40', '2023-06-17 09:38:31', '2023-06-17 09:38:31')
---
    public function StdAttendanceStore(Request $request){
        $inputData =  $request->all();
        foreach($inputData['student_id'] as $key => $value){

            $model =new StdAttendance();
            $model->id_no = $value;
            $model->att_date = $inputData['date'];
            $model->att_status = $inputData['att_status'][$value];
            $model->login_time = $inputData['login_time'][$value];
            $model->logout_time = $inputData['logout_time'][$value];
            $model->save();