app/Http/Controllers/Backend/Student/StudentServiceController.php

select * from `assign_students` where `student_id` = '9' limit 1
select * from `services`
---
    public function StudentServView($id){
        $data['student'] = AssignStudent::with(['student'])->where('student_id',$id)->first();
        $data['services'] = Service::all();