app/Http/Controllers/Backend/Student/StudentRegController.php

select * from `student_years`
select * from `student_classes`
select * from `student_years` order by `id` desc limit 1
select * from `student_classes` limit 1
select * from `assign_students` where `year_id` = 1 and `class_id` = 1
---
    public function StudentRegView(){
    	$data['years'] = StudentYear::all();
    	$data['classes'] = StudentClass::all();

    	$data['year_id'] = StudentYear::orderBy('id','desc')->first()->id;
    	$data['class_id'] = StudentClass::first()->id;
    	// dd($data['class_id']);
    	$data['allData'] = AssignStudent::where('year_id',$data['year_id'])->where('class_id',$data['class_id'])->get();

select * from `student_years`
select * from `student_classes`
select * from `assign_students` where `year_id` = '1' and `class_id` = '3'
---
    public function StudentClassYearWise(Request $request){
    	$data['years'] = StudentYear::all();
    	$data['classes'] = StudentClass::all();

    	$data['year_id'] = $request->year_id;
    	$data['class_id'] = $request->class_id;

    	$data['allData'] = AssignStudent::where('year_id',$request->year_id)->where('class_id',$request->class_id)->get();

select * from `student_years`
select * from `student_classes`
select * from `student_groups`
select * from `student_shifts`
---
    public function StudentRegAdd(){
    	$data['years'] = StudentYear::all();
    	$data['classes'] = StudentClass::all();
    	$data['groups'] = StudentGroup::all();
    	$data['shifts'] = StudentShift::all();

select * from `student_years` where `student_years`.`id` = '1' limit 1
select * from `users` where `usertype` = 'Student' order by `id` desc limit 1
---
    public function StudentRegStore(Request $request){

		// dd($request->all());
    	DB::transaction(function() use($request){
			$checkYear = StudentYear::find($request->year_id)->name;
			$student = User::where('usertype','Student')->orderBy('id','DESC')->first();

				if ($student == null) {
					$firstReg = 0;
					$studentId = $firstReg+1;
					if ($studentId < 10) {
						$id_no = '000'.$studentId;
					}elseif ($studentId < 100) {
						$id_no = '00'.$studentId;
					}elseif ($studentId < 1000) {
						$id_no = '0'.$studentId;
					}
				}else{
			$student = User::where('usertype','Student')->orderBy('id','DESC')->first()->id;

insert into `users` (`id_no`, `password`, `usertype`, `code`, `name`, `fname`, `mname`, `mobile`, `address`, `gender`, `religion`, `dob`, `image`, `updated_at`, `created_at`) values ('20230010', '$2y$10$dxBAeU/V353n0U/uzrJScO1zAn161JxU83Ni8rg25FPl7N5CcMb32', 'Student', 8169, 'Class  Three', 'Test Father #', 'Mother', '2542034654654', 'Test Add ress', 'Male', 'Islam', '1999-01-20', '202306170920download.jfif', '2023-06-17 09:20:33', '2023-06-17 09:20:33')
---
					$file->move(public_path('upload/student_images'),$filename);
					$user['image'] = $filename;
				}
				$user->save();

insert into `assign_students` (`student_id`, `year_id`, `class_id`, `group_id`, `shift_id`, `updated_at`, `created_at`) values (10, '1', '3', '1', '1', '2023-06-17 09:20:33', '2023-06-17 09:20:33')
---
				$assign_student->class_id = $request->class_id;
				$assign_student->group_id = $request->group_id;
				$assign_student->shift_id = $request->shift_id;
				$assign_student->save();

insert into `discount_students` (`assign_student_id`, `fee_category_id`, `discount`, `updated_at`, `created_at`) values (9, 1, '10', '2023-06-17 09:20:33', '2023-06-17 09:20:33')
---
							$discount_student->assign_student_id = $assign_student->id;
							$discount_student->fee_category_id = $key+1;
							$discount_student->discount = $item;
							$discount_student->save();

select * from `student_years`
select * from `student_classes`
select * from `student_groups`
select * from `student_shifts`
select * from `assign_students` where `student_id` = '10' limit 1
---
    public function StudentRegEdit($student_id){
    	$data['years'] = StudentYear::all();
    	$data['classes'] = StudentClass::all();
    	$data['groups'] = StudentGroup::all();
    	$data['shifts'] = StudentShift::all();

    	$data['editData'] = AssignStudent::with(['student','discount'])->where('student_id',$student_id)->first();

select * from `student_years`
select * from `student_classes`
select * from `student_groups`
select * from `student_shifts`
select * from `assign_students` where `student_id` = '9' limit 1
---
    public function StudentRegPromotion($student_id){
    	$data['years'] = StudentYear::all();
    	$data['classes'] = StudentClass::all();
    	$data['groups'] = StudentGroup::all();
    	$data['shifts'] = StudentShift::all();

		$data['editData'] = AssignStudent::with(['student','discount'])->where('student_id',$student_id)->first();

select * from `users` where `users`.`id` in (9)
---
 public function StudentUpdatePromotion(Request $request,$student_id){
    	DB::transaction(function() use($request,$student_id){



    	$user = User::where('id',$student_id)->first();
    	$user->name = $request->name;
    	$user->fname = $request->fname;
    	$user->mname = $request->mname;
    	$user->mobile = $request->mobile;
    	$user->address = $request->address;
    	$user->gender = $request->gender;
    	$user->religion = $request->religion;
    	$user->dob = date('Y-m-d',strtotime($request->dob));

    	if ($request->file('image')) {
    		$file = $request->file('image');
    		@unlink(public_path('upload/student_images/'.$user->image));
    		$filename = date('YmdHi').$file->getClientOriginalName();
    		$file->move(public_path('upload/student_images'),$filename);
    		$user['image'] = $filename;
    	}

select * from `discount_students` where `discount_students`.`assign_student_id` in (9)
---
          $assign_student->shift_id = $request->shift_id;
          $assign_student->save();

		  foreach($request->discount as $key => $item){
			  if($item > 0){
				DiscountStudent::updateOrCreate(['assign_student_id' => $assign_student->id, 'fee_category_id' => $key+1],['discount' => $item]);
			  }
		  }
    	});

select * from `assign_students` where `student_id` = '10' limit 1
---
    public function StudentRegDetails($student_id){
     $data['details'] = AssignStudent::with(['student','discount'])->where('student_id',$student_id)->first();