app/Http/Controllers/Backend/Student/StudentDetailController.php

    public function StudentDetailAdd($id){
        $data['student'] = AssignStudent::where('student_id',$id)->first();
---
select * from `assign_students` where `student_id` = '3' limit 1

				}


				$student_detail->save();
---
insert into `student_details` (`assign_student_id`, `birth_certificate`, `special_need`, `nationality`, `blood`, `alergic_info`, `vaccine_update`, `side_image`, `cr_name`, `cr_address`, `cr_relation`, `cr_contact`, `cr_nid`, `cr_photo`, `f_employment`, `f_address`, `f_contact`, `f_nid`, `f_photo`, `m_employment`, `m_address`, `m_contact`, `m_nid`, `m_photo`, `paf_name`, `paf_address`, `paf_relation`, `paf_contact`, `paf_nid`, `paf_photo`, `pas_name`, `pas_address`, `pas_relation`, `pas_contact`, `pas_nid`, `pas_photo`, `updated_at`, `created_at`) values ('9', '456456465465465', '1', 'Bangladesh', 'O+', 'Yes-{Hilsha}', 'Yes', '202306170927images.jpg', 'Gardiyan', 'Sam', 'Uncle', '46156486465', '44654544654', '202306170927fantasy-2049567_960_720.jpg', 'Govt', 'Ok', '165465465', '6546545564', '202306170927images (2).jfif', 'k;kjlk', 'hsadjhkj', '2645+646546546', '4654654465465', '202306170927istockphoto-1322277517-612x612.jpg', 'Driver', 'AMkjhkjf', 'Other', '321565224', '5+465+5+6', '202306170927fantasy-2049567_960_720.jpg', 'H:KJDG', 'asdsadf', 'GMother', '46546544564', '45665455654', '202306170927images (1).jfif', '2023-06-17 09:27:09', '2023-06-17 09:27:09')