app/Http/Controllers/Backend/Employee/EduInsDtlsController.php

    public function EmployeeEducationView(){
        $data['allData'] = User::where('usertype', 'Employee')->get();
---
select * from `users` where `usertype` = 'Employee'

    public function EmployeeEducationAdd($id){
        $emp_data = User::find($id);
        $ins_data = InstitutionInfo::all();
---
select * from `users` where `users`.`id` = '2' limit 1
select * from `institution_infos`