app/Http/Controllers/Backend/Employee/EmployeeRegController.php

    public function EmployeeView(){

    	$data['allData'] = User::where('usertype','Employee')->get();
---
select * from `users` where `usertype` = 'Employee'

    public function EmployeeAdd(){
    	$data['designation'] = Designation::all();
---
select * from `designations`

    public function EmployeeEdit($id){
    	$data['editData'] = User::find($id);
    	$data['designation'] = Designation::all();
---
select * from `users` where `users`.`id` = '2' limit 1
select * from `designations`