app/Http/Controllers/Backend/Employee/EmployeeAttendanceController.php

    public function AttendanceView(){
        $data['allData'] = EmployeeAttendance::select('date')->groupBy('date')->orderBy('date','DESC')->get();
---
select `date` from `employee_attendances` group by `date` order by `date` desc

    public function AttendanceAdd(){
    	$data['employees'] = User::where('usertype','employee')->get();
---
select * from `users` where `usertype` = 'employee'

    public function AttendanceStore(Request $request){

    	EmployeeAttendance::where('date', date('Y-m-d', strtotime($request->date)))->delete();
---
delete from `employee_attendances` where `date` = '2023-06-17'