app/Http/Controllers/Backend/Employee/EmployeeSalaryController.php

select * from `users` where `usertype` = 'employee'
---
    public function SalaryView(){
    	$data['allData'] = User::where('usertype','employee')->get();