app/Http/Controllers/Backend/Employee/EmpOffInfoController.php

select * from `departments`
select * from `sections`
select * from `users` where `users`.`id` = '2' limit 1
select * from `institution_infos`
---
    public function EmployeeOfficeAdd($id){
        $department =Department::all();
        $section =Section::all();
        $emp_data = User::find($id);
        $ins_data = InstitutionInfo::all();