app/Http/Controllers/Backend/Setup/DepartmentController.php

    public function ViewDepartment(){
    	$data['allData'] = Department::all();
---
select * from `departments`