app/Http/Controllers/Backend/Setup/ItemSubCategoryController.php

select `item_sub_categories`.*, `item_categories`.`cat_name` from `item_sub_categories` left join `item_categories` on `item_sub_categories`.`category_id` = `item_categories`.`id`
---
    public function ViewItemSubCategory(){
    	$data['allData'] = DB::table('item_sub_categories')
                           ->leftJoin('item_categories','item_sub_categories.category_id','=','item_categories.id')
                           ->select('item_sub_categories.*','item_categories.cat_name')
                           ->get();