app/Http/Controllers/Backend/Setup/ItemController.php

    public function ViewItem(){
    	$data['allData'] = DB::table('items')
                           ->leftJoin('item_sub_categories','items.sub_category_id','=','item_sub_categories.id')
                           ->select('items.*','item_sub_categories.sub_cat_name')
                           ->get();
---
select `items`.*, `item_sub_categories`.`sub_cat_name` from `items` left join `item_sub_categories` on `items`.`sub_category_id` = `item_sub_categories`.`id`