app/Http/Controllers/Backend/Setup/ItemCategoryController.php

    public function ViewItemCategory(){
    	$data['allData'] = ItemCategory::all();
---
select * from `item_categories`