app/Http/Controllers/Backend/Setup/SectionController.php

    public function ViewSection(){
    	$data['allData'] = DB::table('sections')
                           ->leftJoin('departments','sections.department_id','=','departments.id')
                           ->select('sections.*','departments.dep_name')
                           ->get();
---
select `sections`.*, `departments`.`dep_name` from `sections` left join `departments` on `sections`.`department_id` = `departments`.`id`

    public function SectionAdd(){

        $data['department'] = Department::all();
---
select * from `departments`

    public function SectionStore(Request $request){
	    	$validatedData = $request->validate([
	    		'sec_name' => 'required|unique:sections,sec_name',
				'department_id' => 'required',

	    	]);

	    	$data = new Section();
	    	$data->sec_name = $request->sec_name;
			$data->department_id = $request->department_id;
	    	$data->save();
---
insert into `sections` (`sec_name`, `department_id`, `updated_at`, `created_at`) values ('4th Class', '1', '2023-06-17 09:13:34', '2023-06-17 09:13:34')