app/Http/Controllers/Backend/Setup/ServiceController.php

    public function ViewService(){
            $data['allData'] = Service::all();
---
select * from `services`

    public function ServiceStore(Request $request){
	    	$validatedData = $request->validate([
	    		'name' => 'required|unique:services,name',
	    	]);
	    	$data = new Service();
	    	$data->name = $request->name;
	    	$data->save();
---
insert into `services` (`name`, `updated_at`, `created_at`) values ('Test 1500', '2023-06-17 09:10:57', '2023-06-17 09:10:57')