app/Http/Controllers/Backend/Setup/ServiceAmountController.php

select `service_id` from `service_amounts` group by `service_id`
---
    public function ViewServiceAmount(){
        // $data['allData'] = ServiceAmount::all();
        $data['allData'] = ServiceAmount::select('service_id')->groupBy('service_id')->get();

select * from `services`
select * from `student_classes`
---
    public function AddServiceAmount(){
    	$data['services'] = Service::all();
    	$data['classes'] = StudentClass::all();

insert into `service_amounts` (`service_id`, `class_id`, `amount`, `updated_at`, `created_at`) values ('2', '1', '1500', '2023-06-17 09:12:19', '2023-06-17 09:12:19')
---
    public function StoreServiceAmount(Request $request){

    	$countClass = count($request->class_id);
    	if ($countClass !=NULL) {
    		for ($i=0; $i <$countClass ; $i++) {
    			$service_amount = new ServiceAmount();
    			$service_amount->service_id = $request->service_id;
    			$service_amount->class_id = $request->class_id[$i];
    			$service_amount->amount = $request->amount[$i];
    			$service_amount->save();

select * from `service_amounts` where `service_id` = '1' order by `class_id` asc
---
 	public function DetailsServiceAmount($service_id){
		$data['detailsData'] = ServiceAmount::where('service_id',$service_id)->orderBy('class_id','asc')->get();