app/Http/Controllers/Backend/Setup/UnitController.php

    public function index()
    {
        $data['units']= Unit::all();
---
select * from `units`

    public function edit($id)
    {
        $data['unit'] = Unit::find($id);
        $data['units']= Unit::all();
---
select * from `units` where `units`.`id` = '7' limit 1
select * from `units`

    public function update(Request $request, $id)
    {
        $data = Unit::find($id);
---
select * from `units` where `units`.`id` = '7' limit 1